espressif/esp-idf/components/soc/esp32c3/register/soc/uart_struct.h
            uint32_t data:        8;                    /*This register is used to configure the content of at_cmd char.*/
            uint32_t at_char_num: 8;                    /*This register is used to configure the num of continuous at_cmd chars received by receiver.*/
            uint32_t reserved16: 16;                    /*Reserved*/
        };
        uint32_t val;
    } at_cmd_char;
    union {
        struct {
            uint32_t reserved0:     1;
            uint32_t rx_size:       3;                  /*This register is used to configure the amount of mem allocated for receive-FIFO. The default number is 128 bytes.*/
            uint32_t tx_size:       3;                  /*This register is used to configure the amount of mem allocated for transmit-FIFO. The default number is 128 bytes.*/
            uint32_t rx_flow_thrhd: 9;                  /*This register is used to configure the maximum amount of data that can be received  when hardware flow control works.*/
            uint32_t rx_tout_thrhd:10;                  /*This register is used to configure the threshold time that receiver takes to receive one byte. The rxfifo_tout_int interrupt will be trigger when the receiver takes more time to receive one byte with rx_tout_en set to 1.*/
            uint32_t force_pd:      1;                  /*Set this bit to force power down UART memory.*/
            uint32_t force_pu:      1;                  /*Set this bit to force power up UART memory.*/
            uint32_t reserved28:    4;
        };
        uint32_t val;
    } mem_conf;
    union {
        struct {
            uint32_t apb_tx_waddr:10;                   /*This register stores the offset address in Tx-FIFO when software writes Tx-FIFO via APB.*/
            uint32_t reserved10:   1;                   /*Reserved*/
            uint32_t tx_raddr:    10;                   /*This register stores the offset address in Tx-FIFO when Tx-FSM reads data via Tx-FIFO_Ctrl.*/
            uint32_t reserved21:  11;                   /*Reserved*/
        };
        uint32_t val;
    } mem_tx_status;
    union {
        struct {
            uint32_t apb_rx_raddr:10;                   /*This register stores the offset address in RX-FIFO when software reads data from Rx-FIFO via APB. UART0 is 10'h100. UART1 is 10'h180.*/
            uint32_t reserved10:   1;                   /*Reserved*/
            uint32_t rx_waddr:    10;                   /*This register stores the offset address in Rx-FIFO when Rx-FIFO_Ctrl writes Rx-FIFO. UART0 is 10'h100. UART1 is 10'h180.*/
            uint32_t reserved21:  11;                   /*Reserved*/
        };
        uint32_t val;
    } mem_rx_status;
    union {
        struct {
            uint32_t st_urx_out: 4;                     /*This is the status register of receiver.*/
            uint32_t st_utx_out: 4;                     /*This is the status register of transmitter.*/
            uint32_t reserved8: 24;                     /*Reserved*/
        };
        uint32_t val;
    } fsm_status;
    union {
        struct {
            uint32_t min_cnt:        12;                /*This register stores the minimal input clock count between two positive edges. It is used in boudrate-detect process.*/
            uint32_t reserved12:     20;                /*Reserved*/
        };
        uint32_t val;
    } pospulse;
    union {
        struct {
            uint32_t min_cnt:        12;                /*This register stores the minimal input clock count between two negative edges. It is used in boudrate-detect process.*/
            uint32_t reserved12:     20;                /*Reserved*/
        };
        uint32_t val;
    } negpulse;
    union {
        struct {
            uint32_t sclk_div_b:   6;                   /*The  denominator of the frequency divider factor.*/
            uint32_t sclk_div_a:   6;                   /*The numerator of the frequency divider factor.*/
            uint32_t sclk_div_num: 8;                   /*The integral part of the frequency divider factor.*/
            uint32_t sclk_sel:     2;                   /*UART clock source select. 1: 80Mhz  2: 8Mhz  3: XTAL.*/
            uint32_t sclk_en:      1;                   /*Set this bit to enable UART Tx/Rx clock.*/
            uint32_t rst_core:     1;                   /*Write 1 then write 0 to this bit  reset UART Tx/Rx.*/
            uint32_t tx_sclk_en:   1;                   /*Set this bit to enable UART Tx clock.*/
            uint32_t rx_sclk_en:   1;                   /*Set this bit to enable UART Rx clock.*/
            uint32_t tx_rst_core:  1;                   /*Write 1 then write 0 to this bit  reset UART Tx.*/
            uint32_t rx_rst_core:  1;                   /*Write 1 then write 0 to this bit  reset UART Rx.*/
            uint32_t reserved28:   4;
        };
        uint32_t val;
    } clk_conf;
    uint32_t date;                                      /*UART Version register*/
    union {
        struct {
            uint32_t id                            :    30;  /*This register is used to configure the uart_id.*/
            uint32_t high_speed                    :    1;  /*This bit used to select synchronize mode. 1: Registers are auto synchronized into UART Core clock and UART core should be keep the same with APB clock. 0: After configure registers, software needs to write 1 to UART_REG_UPDATE to synchronize registers. */
            uint32_t update                        :    1;  /*Software write 1 would synchronize registers into UART Core clock domain and would be cleared by hardware after synchronization is done.*/
        };
        uint32_t val;
    } id;
} uart_dev_t;
extern uart_dev_t UART0;
extern uart_dev_t UART1;
#ifdef __cplusplus
}
#endif
